---------------------------------------------------------------------------
      name:  <unnamed>
       log:  Q:\BMGF - PMA IPUMS FP Blog Posts\PMA 2022 longitudinal guide 
> - Stata files\Blog6_log.txt
  log type:  text
 opened on:   8 Nov 2022, 04:37:29

. 
. * You only need to run these commands once on each Stata computer 
. *ssc install heatplot,  replace
. *ssc install palettes,  replace
. *ssc install colrspace, replace
. *net install grc1leg2.pkg
. 
. use pma_00122, clear

. 
. * Filter the data to keep only who complete FQ and belong to de facto pop
> ulation
. keep if resultfq_1 == 1 & resultfq_2 == 1
(12,010 observations deleted)

. keep if resident_1 == 11 | resident_1 == 22
(244 observations deleted)

. keep if resident_2 == 11 | resident_2 == 22
(211 observations deleted)

. 
. * Generate string code for each country
. decode country, gen(country_cal)

. replace country_cal = "BF" if country_cal == "burkina faso"
(5,208 real changes made)

. replace country_cal = "CD" if country_cal == "congo, democratic republic"
(3,482 real changes made)

. replace country_cal = "KE" if country_cal == "kenya"
(6,935 real changes made)

. replace country_cal = "NG" if country_cal == "nigeria"
(2,087 real changes made)

. 
. * Generate a short ID variable for each woman
. gen id = _n, before(sample_1)

. 
. *************************************************************************
> *******
. 
. * Generate CMC variables
. gen intfqcmc_1 = intfqmon_1 +12*(intfqyear_1 -1900) if ///
>                  intfqmon_1 < 90 & intfqyear_1 < 9000

. gen intfqcmc_2 = intfqmon_2 +12*(intfqyear_2 -1900) if ///
>                  intfqmon_2 < 90 & intfqyear_2 < 9000

. 
. foreach s in kid1stbirth lastbirth otherbirth panelbirth ///
>              pregend panelpregend fpbeginuse {
  2.         gen `s'cmc_1 = `s'mo_1 + 12*(`s'yr_1 - 1900) if ///
>                            `s'mo_1 < 90 & `s'yr_1 < 9000
  3.         gen `s'cmc_2 = `s'mo_2 + 12*(`s'yr_2 - 1900) if ///
>                            `s'mo_2 < 90 & `s'yr_2 < 9000                 
>                   
  4. }
(7,788 missing values generated)
(7,204 missing values generated)
(4,969 missing values generated)
(4,507 missing values generated)
(17,567 missing values generated)
(17,531 missing values generated)
(17,712 missing values generated)
(15,065 missing values generated)
(16,962 missing values generated)
(16,962 missing values generated)
(17,712 missing values generated)
(17,253 missing values generated)
(10,677 missing values generated)
(9,706 missing values generated)

. 
. *************************************************************************
> *******
. 
. * List six rows fron a contracted frequency dataset 
. * (The same six lines shown in the R blog post.)
. preserve

. contract panelbirthmo_2 panelbirthyr_2 panelbirthcmc_2, freq(freq)

. describe

Contains data from pma_00122.dta
 Observations:            92                  
    Variables:             4                  31 MAY 2022 19:02
---------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
---------------------------------------------------------------------------
panelbirthmo_2  byte    %8.0g      PANELBIRTHMO_2
                                              month of birth since previous
                                                panel survey
panelbirthyr_2  int     %8.0g      PANELBIRTHYR_2
                                              year of birth since previous
                                                panel survey
panelbirthcmc_2 float   %9.0g                 
freq            int     %12.0g                Frequency
---------------------------------------------------------------------------
Sorted by: panelbirthmo_2  panelbirthyr_2  panelbirthcmc_2
     Note: Dataset has changed since last saved.

. list in -6/-1, nolabel noobs sep(6)

  +----------------------------------------+
  | pane~o_2   pane~r_2   pane~c_2    freq |
  |----------------------------------------|
  |       12       2017       1416       1 |
  |       12       2018       1428      13 |
  |       12       2019       1440      99 |
  |       12       2020       1452      90 |
  |       97       2017          .       1 |
  |       99       9999          .   15064 |
  +----------------------------------------+

. restore

. 
. *************************************************************************
> *******
. 
. * Gen the cmc date for the first month of each country's survey
. gen calstart_1 = 2017

. replace calstart_1 = 2018 if country_cal == "BF"
(5,208 real changes made)

. gen calstart_2 = 2018

. replace calstart_1 = 12*(calstart_1 -1900) + 1
(17,712 real changes made)

. replace calstart_2 = 12*(calstart_2 -1900) + 1
(17,712 real changes made)

. 
. *************************************************************************
> *******
. 
. * Gen vars that cover a range of months in each sample
. gen calstop_1 = intfqcmc_1

. gen calstop_2 = intfqcmc_2

. 
. *************************************************************************
> *******
. 
. * list 10 samples to show that CALENDARKE_1 is blank for these women from
>  Burkina Faso
. list id country_cal calendarbf_1 calendarke_1 in 1/10 if country_cal == "
> BF", noobs sep(10)

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                1               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                2               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                3               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                4               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,5,5,5,5,5,5,5,5,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                5               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                6               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                7               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                8               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,B,P,P,P,P,P,P,P,P,P,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |                9               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,,3,3,3,3,3,3,3,3,3,3,3.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

  +-----------------------------------------------------------------------+
  |               id               |               countr~l               |
  |               10               |                     BF               |
  |-----------------------------------------------------------------------|
  | calendarbf_1                                                          |
  |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,.. |
  |-----------------------------------------------------------------------|
  |                               cale~e_1                                |
  |                                                                       |
  +-----------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * Save the filtered dataset for later use
. save post6_filtered_dataset, replace
(file post6_filtered_dataset.dta not found)
file post6_filtered_dataset.dta saved

. 
. *************************************************************************
> *******
. 
. * keep only certain vars
. keep id country_cal cal*

. 
. save post6_cal1, replace
(file post6_cal1.dta not found)
file post6_cal1.dta saved

. 
. *************************************************************************
> *******
. 
. * reshape the data to long
. reshape long calendarke_ calendarkewhy_ calendarng_ calendarngwhy_ calend
> arbf_ calendarbfwhy_ calendarcd_ calendarcdwhy_ calstart_ calstop_ , i(id
> ) j(phase)
(j = 1 2)

Data                               Wide   ->   Long
---------------------------------------------------------------------------
> --
Number of observations           17,712   ->   35,424      
Number of variables                  22   ->   13          
j variable (2 values)                     ->   phase
xij variables:
              calendarke_1 calendarke_2   ->   calendarke_
        calendarkewhy_1 calendarkewhy_2   ->   calendarkewhy_
              calendarng_1 calendarng_2   ->   calendarng_
        calendarngwhy_1 calendarngwhy_2   ->   calendarngwhy_
              calendarbf_1 calendarbf_2   ->   calendarbf_
        calendarbfwhy_1 calendarbfwhy_2   ->   calendarbfwhy_
              calendarcd_1 calendarcd_2   ->   calendarcd_
        calendarcdwhy_1 calendarcdwhy_2   ->   calendarcdwhy_
                  calstart_1 calstart_2   ->   calstart_
                    calstop_1 calstop_2   ->   calstop_
---------------------------------------------------------------------------
> --

. rename calendarbfwhy_ calendarbfwhy

. rename calendarbf_ calendarbf

. rename calendarcdwhy_ calendarcdwhy

. rename calendarcd_ calendarcd

. rename calendarkewhy_ calendarkewhy

. rename calendarke_ calendarke

. rename calendarng_ calendarng

. rename calendarngwhy_ calendarngwhy

. rename calstart_ calstart

. rename calstop_ calstop

. 
. list in 1/10

     +--------------------------------------------------------------------+
  1. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   1  |      1  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                           ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1442   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   1  |      2  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |               ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1453   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   2  |      1  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                   ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                          ,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1441   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   2  |      2  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     | ,,,,,,,,,,,,5,5,5,5,5,5,5,5,5,B,P,P,P,P,P,P,P,P,0,0,0,0,0,0,3,3,.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |              ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1453   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   3  |      1  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1441   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   3  |      2  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1453   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   4  |      1  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                   ,,,,,,,,,,,0,0,0,5,5,5,5,5,5,5.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                          ,,,,,,,,,,,,,,1,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1441   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   4  |      2  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     | ,,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,5,5,5,5,.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |             ,,,,,,,,,,,,,,,,,,,,,,,,,,12,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1452   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   5  |      1  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                           ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1441   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |  id  |  phase  |  calend~e  |  cal~ewhy  |  calend~g  |  cal~gwhy  |
     |   5  |      2  |            |            |            |            |
     |--------------------------------------------------------------------|
     | calendarbf                                                         |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 calendarbfwhy      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |  calend~d   |  cal~dwhy   |  countr~l   |  calstart   |  calstop   |
     |             |             |        BF   |      1417   |     1453   |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * relocate calendarbfwhy calendarbf
. order calendarbf* , before(calendarke)

. 
. * rename variables
. foreach i in calendarbf calendarcd calendarke calendarng {
  2.         rename `i' `i'fpstatus
  3. }

. 
. foreach v in calendar*why {
  2.         rename `v' `v'stop
  3. }

. 
. * reshape again to long
. reshape long calendar@fpstatus calendar@whystop, i(id phase) j(country) s
> tring
(j = bf cd ke ng)

Data                               Wide   ->   Long
---------------------------------------------------------------------------
> --
Number of observations           35,424   ->   141,696     
Number of variables                  13   ->   8           
j variable (4 values)                     ->   country
xij variables:
calendarbffpstatus calendarcdfpstatus ... calendarngfpstatus->calendarfpsta
> tus
calendarbfwhystop calendarcdwhystop ... calendarngwhystop->calendarwhystop
---------------------------------------------------------------------------
> --

. rename calendarfpstatus fpstatus

. rename calendarwhystop whystop

. 
. *************************************************************************
> *******
. 
. list in 1/8

     +--------------------------------------------------------------------+
  1. |        id         |        phase         |         country         |
     |         1         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,.. |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                     ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1442             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |        id         |        phase         |         country         |
     |         1         |            1         |              cd         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1442             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |        id         |        phase         |         country         |
     |         1         |            1         |              ke         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1442             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |        id         |        phase         |         country         |
     |         1         |            1         |              ng         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1442             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |        id         |        phase         |         country         |
     |         1         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |         ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |        id         |        phase         |         country         |
     |         1         |            2         |              cd         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |        id         |        phase         |         country         |
     |         1         |            2         |              ke         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |        id         |        phase         |         country         |
     |         1         |            2         |              ng         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                 whystop | countr~l |
     |                                                         |       BF |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * keep only where country_cal == country_cal
. keep if upper(country) == country_cal
(106,272 observations deleted)

. 
. list in 1/6

     +--------------------------------------------------------------------+
  1. |        id         |        phase         |         country         |
     |         1         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                           ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1442        |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |        id         |        phase         |         country         |
     |         1         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |               ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1453        |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |        id         |        phase         |         country         |
     |         2         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                          ,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1441        |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |        id         |        phase         |         country         |
     |         2         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,,5,5,5,5,5,5,5,5,5,B,P,P,P,P,P,P,P,P,0,0,0,0,0,0,3,3,.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |              ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1453        |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |        id         |        phase         |         country         |
     |         3         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1441        |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |        id         |        phase         |         country         |
     |         3         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |       countr~l       |       calstart       |       calstop        |
     |             BF       |           1417       |          1453        |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. * drop country_cal
. drop country_cal

. * list 10 samples
. list in 1/10

     +--------------------------------------------------------------------+
  1. |        id         |        phase         |         country         |
     |         1         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                           ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1442             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |        id         |        phase         |         country         |
     |         1         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |               ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |        id         |        phase         |         country         |
     |         2         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                          ,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1441             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |        id         |        phase         |         country         |
     |         2         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,,5,5,5,5,5,5,5,5,5,B,P,P,P,P,P,P,P,P,0,0,0,0,0,0,3,3,.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |              ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |        id         |        phase         |         country         |
     |         3         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1441             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |        id         |        phase         |         country         |
     |         3         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |        id         |        phase         |         country         |
     |         4         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,5,5,5,5,5,5,5.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                          ,,,,,,,,,,,,,,1,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1441             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |        id         |        phase         |         country         |
     |         4         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,5,5,5,5,.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |             ,,,,,,,,,,,,,,,,,,,,,,,,,,12,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1452             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |        id         |        phase         |         country         |
     |         5         |            1         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                           ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,      |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1441             |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |        id         |        phase         |         country         |
     |         5         |            2         |              bf         |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                       whystop      |
     |                                                                    |
     |--------------------------------------------------------------------|
     |             calstart             |             calstop             |
     |                 1417             |                1453             |
     +--------------------------------------------------------------------+

. * gen a var to indicate if fpstatus == "" and proportion table of this va
> riable
. gen empty_fpstatu = fpstatus == ""

. table ( empty_fpstatu ) () (), nototals statistic(frequency) statistic(pr
> oportion) missing

---------------------------------------
              |  Frequency   Proportion
--------------+------------------------
empty_fpstatu |                        
  0           |     28,153        .7947
  1           |      7,271        .2053
---------------------------------------

. 
. *************************************************************************
> *******
. 
. * save this dataset for later use
. drop empty_fpstatu

. save post6_cal1, replace
file post6_cal1.dta saved

. 
. *************************************************************************
> *******
. 
. * import the filtered data
. use post6_filtered_dataset, clear

. keep id *cmc* pregnant* fpcurreffmethrc*

. drop intfq*

. * reshape to long
. unab vars : *_1

. local vars " `vars'" 

. local vars : subinstr local vars "_1" " ", all

. 
. reshape long pregnant_ fpcurreffmethrc_ kid1stbirthcmc_ lastbirthcmc_ ///
>              otherbirthcmc_ panelbirthcmc_ pregendcmc_ panelpregendcmc_ /
> //
>                          fpbeginusecmc_ , i(id) j(phase)
(j = 1 2)

Data                               Wide   ->   Long
---------------------------------------------------------------------------
> --
Number of observations           17,712   ->   35,424      
Number of variables                  19   ->   11          
j variable (2 values)                     ->   phase
xij variables:
                  pregnant_1 pregnant_2   ->   pregnant_
    fpcurreffmethrc_1 fpcurreffmethrc_2   ->   fpcurreffmethrc_
      kid1stbirthcmc_1 kid1stbirthcmc_2   ->   kid1stbirthcmc_
          lastbirthcmc_1 lastbirthcmc_2   ->   lastbirthcmc_
        otherbirthcmc_1 otherbirthcmc_2   ->   otherbirthcmc_
        panelbirthcmc_1 panelbirthcmc_2   ->   panelbirthcmc_
              pregendcmc_1 pregendcmc_2   ->   pregendcmc_
    panelpregendcmc_1 panelpregendcmc_2   ->   panelpregendcmc_
        fpbeginusecmc_1 fpbeginusecmc_2   ->   fpbeginusecmc_
---------------------------------------------------------------------------
> --

. 
. rename pregnant_ pregnant

. rename fpcurreffmethrc_ fpcurreffmethrc

. rename kid1stbirthcmc_ kid1stbirthcmc

. rename lastbirthcmc_ lastbirthcmc

. rename otherbirthcmc_ otherbirthcmc

. rename panelbirthcmc_ panelbirthcmc

. rename pregendcmc_ pregendcmc

. rename panelpregendcmc_ panelpregendcmc

. rename fpbeginusecmc_ fpbeginusecmc

. 
. * merge this dataset with the dataset we saved as post6_cal1 by id and ph
> ase
. merge 1:1 id phase using post6_cal1,  nogenerate 

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            35,424  
    -----------------------------------------

. * generate calmissing var
. gen criteria = 0

. foreach v of varlist *cmc {
  2.         replace criteria  = 1 if `v'!= . & `v' >= calstart
  3. }
(404 real changes made)
(11,421 real changes made)
(0 real changes made)
(0 real changes made)
(992 real changes made)
(0 real changes made)
(4,619 real changes made)

. gen calmissing = 0, after(phase)

. replace calmissing = 1 if fpstatus == "" & whystop == "" & (pregnant == 1
>  | criteria == 1)
(1,460 real changes made)

. drop criteria

. * relocate calstart
. order calstart , after(calmissing)

. * show 10 obs
. list in 1/10

     +--------------------------------------------------------------------+
  1. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  1 |     1 |        0 |     1417 |       no | niu (not |     1314  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1430 |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                      ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, |    1442 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  1 |     2 |        0 |     1417 |       no | implants |     1314  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1430 |     1430 |     1430 |        .  |        .  |     1448  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |          ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, |    1453 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  2 |     1 |        0 |     1417 |      yes | niu (not |        .  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1390 |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                     ,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,, |    1441 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  2 |     2 |        0 |     1417 |       no | injectab |        .  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1443 |        . |     1443 |        .  |        .  |     1444  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,,5,5,5,5,5,5,5,5,5,B,P,P,P,P,P,P,P,P,0,0,0,0,0,0,3,3,.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |         ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,, |    1453 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  3 |     1 |        0 |     1417 |       no | niu (not |        .  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |        . |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                                                          |    1441 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  3 |     2 |        0 |     1417 |       no | niu (not |        .  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |        . |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                                                          |    1453 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  4 |     1 |        0 |     1417 |       no | injectab |     1324  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1406 |        . |        . |        .  |        .  |     1428  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,5,5,5,5,5,5,5.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                     ,,,,,,,,,,,,,,1,,,,,,,,,,,,,,,,,,,,, |    1441 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  4 |     2 |        0 |     1417 |       no | niu (not |     1324  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1406 |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     | ,,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0,0,0,5,5,5,5,5,5,5,5,5,5,5,5,.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |        ,,,,,,,,,,,,,,,,,,,,,,,,,,12,,,,,,,,,,,,,,,,,,,,, |    1452 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  5 |     1 |        0 |     1417 |       no | niu (not |     1366  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1422 |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                   ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0.. |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                      ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,, |    1441 |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. | id | phase | calmis~g | calstart | pregnant | fpcurr~c | kid1st~c  |
     |  5 |     2 |        1 |     1417 |       no | niu (not |     1366  |
     |--------------------------------------------------------+-----------|
     | lastbi~c | otherb~c | panelb~c | pregen~c  | panelp~c  | fpbegi~c  |
     |     1422 |        . |        . |        .  |        .  |        .  |
     |--------------------------------------------------------------------|
     |                              country                               |
     |                                   bf                               |
     |--------------------------------------------------------------------|
     | fpstatus                                                           |
     |                                                                    |
     |--------------------------------------------------------------------|
     |                                                  whystop | calstop |
     |                                                          |    1453 |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * create another prop table to compare with simply using fpstatus as crit
> eria
. gen empty_fpstatu = fpstatus == ""

. table ( empty_fpstatu ) ( calmissing ) (), nototals statistic(frequency) 
> statistic(proportion) 

---------------------------------
               |     calmissing  
               |       0        1
---------------+-----------------
empty_fpstatu  |                 
  0            |                 
    Frequency  |  28,153         
    Proportion |   .7947         
  1            |                 
    Frequency  |   5,811    1,460
    Proportion |    .164   .04121
---------------------------------

. drop empty_fpstatu

. 
. *************************************************************************
> *******
. 
. * relabel fpcurreffmethrc
. gen fpcur = fpcurreffmethrc

. label define fpcurreffmethrc_code 999 "0" 101 "1" 102 "2" 111 "3" 112 "4"
>  121 "5" 123 "5" 131 "7" 132 "8" 141 "9" 142 "10" 151 "11" 152 "12" 160 "
> 13" 170 "14" 210 "30" 220 "31" 240 "39"

. label values fpcur fpcurreffmethrc_code

. decode fpcur, gen(fpcurreffmethrc_new)

. drop fpcur

. * gen caldur to calculate the duration of each woman
. gen caldur = calstop - calstart + 1

. * replace ", fpstatus" caldur times
. 
. *************************************************************************
> *******
. 
. * Generate a long string of repeated values of fpcurreffmethrc_new and 
. * insert it into fpstatus, for respondents where fpstatus == "" & calmiss
> ing == 0
. capture drop longstring 

. gen longstring = ""
(35,424 missing values generated)

. sum caldur

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
      caldur |     35,424    34.32828    3.891919         24         40

. 
. forvalues i = 1/`=r(max)' {
  2.         replace longstring = longstring + fpcurreffmethrc_new + ", " i
> f `i' <= caldur
  3. }
variable longstring was str1 now str4
(35,424 real changes made)
variable longstring was str4 now str8
(35,424 real changes made)
variable longstring was str8 now str12
(35,424 real changes made)
variable longstring was str12 now str16
(35,424 real changes made)
variable longstring was str16 now str20
(35,424 real changes made)
variable longstring was str20 now str24
(35,424 real changes made)
variable longstring was str24 now str28
(35,424 real changes made)
variable longstring was str28 now str32
(35,424 real changes made)
variable longstring was str32 now str36
(35,424 real changes made)
variable longstring was str36 now str40
(35,424 real changes made)
variable longstring was str40 now str44
(35,424 real changes made)
variable longstring was str44 now str48
(35,424 real changes made)
variable longstring was str48 now str52
(35,424 real changes made)
variable longstring was str52 now str56
(35,424 real changes made)
variable longstring was str56 now str60
(35,424 real changes made)
variable longstring was str60 now str64
(35,424 real changes made)
variable longstring was str64 now str68
(35,424 real changes made)
variable longstring was str68 now str72
(35,424 real changes made)
variable longstring was str72 now str76
(35,424 real changes made)
variable longstring was str76 now str80
(35,424 real changes made)
variable longstring was str80 now str84
(35,424 real changes made)
variable longstring was str84 now str88
(35,424 real changes made)
variable longstring was str88 now str92
(35,424 real changes made)
variable longstring was str92 now str96
(35,424 real changes made)
variable longstring was str96 now str100
(35,401 real changes made)
variable longstring was str100 now str104
(30,968 real changes made)
variable longstring was str104 now str108
(30,217 real changes made)
variable longstring was str108 now str112
(30,216 real changes made)
variable longstring was str112 now str116
(30,216 real changes made)
variable longstring was str116 now str120
(30,216 real changes made)
variable longstring was str120 now str124
(30,216 real changes made)
variable longstring was str124 now str128
(30,216 real changes made)
variable longstring was str128 now str132
(30,216 real changes made)
variable longstring was str132 now str136
(30,216 real changes made)
variable longstring was str136 now str140
(30,216 real changes made)
variable longstring was str140 now str144
(19,798 real changes made)
variable longstring was str144 now str148
(6,730 real changes made)
variable longstring was str148 now str152
(812 real changes made)
variable longstring was str152 now str156
(212 real changes made)
(3 real changes made)

. replace longstring = substr(longstring, 1, strlen(longstring) - 2)
(35,424 real changes made)

. replace fpstatus = longstring if trim(fpstatus) == "" & calmissing == 0
(5,811 real changes made)

. drop longstring

. 
. generate new_string = subinstr(fpstatus,"  ", "", .)
(1,460 missing values generated)

. * drop variables
. drop *cmc caldur calstop calmissing pregnant fpcurreffmethrc fpcurreffmet
> hrc_new fpstatus

. 
. *************************************************************************
> *******
. 
. * reshape it to long so one value per row
. rename new_string value_fpstatus

. rename whystop value_whystop

. reshape long value_, i(id phase) j(name) string
(j = fpstatus whystop)

Data                               Wide   ->   Long
---------------------------------------------------------------------------
> --
Number of observations           35,424   ->   70,848      
Number of variables                   6   ->   6           
j variable (2 values)                     ->   name
xij variables:
           value_fpstatus value_whystop   ->   value_
---------------------------------------------------------------------------
> --

. rename value_ value

. list in 1/10

     +--------------------------------------------------------------------+
  1. |   id   |   phase    |       name    |   calstart    |   country    |
     |    1   |       1    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P,P,P,P,P,P,0,0,0,0,0      |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |   id   |   phase    |       name    |   calstart    |   country    |
     |    1   |       1    |    whystop    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     |                     ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,            |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |   id   |   phase    |       name    |   calstart    |   country    |
     |    1   |       2    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,3,3,3,3,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,B,P,P,P.. |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |   id   |   phase    |       name    |   calstart    |   country    |
     |    1   |       2    |    whystop    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,                    |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |   id   |   phase    |       name    |   calstart    |   country    |
     |    2   |       1    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,P,P,P,P,P,P,P,0,0,0,0,0,0,0,3,3,3,3,3,3,3,3,3,3,3       |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |   id   |   phase    |       name    |   calstart    |   country    |
     |    2   |       1    |    whystop    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     |                     ,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,           |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |   id   |   phase    |       name    |   calstart    |   country    |
     |    2   |       2    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,,5,5,5,5,5,5,5,5,5,B,P,P,P,P,P,P,P,P,0,0,0,0,0,0,3,3,.. |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |   id   |   phase    |       name    |   calstart    |   country    |
     |    2   |       2    |    whystop    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,6,,,,,,,,,,,                   |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |   id   |   phase    |       name    |   calstart    |   country    |
     |    3   |       1    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     | ,,,,,,,,,,,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0       |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |   id   |   phase    |       name    |   calstart    |   country    |
     |    3   |       1    |    whystop    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | value                                                              |
     |                                                                    |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * calculate the number of variables we need to generate by counting the n
> umber of "," then plus 1
. gen l1 = length(value)

. gen l2= length(subinstr(value,",","",.))

. gen tempvalue = trim(value)
(14,889 missing values generated)

. replace tempvalue = subinstr(tempvalue,",",", ",.)
variable tempvalue was str150 now str187
(55,959 real changes made)

. 
. gen l = l1 - l2

. replace l = l+1 if l != 0
(55,959 real changes made)

. 
. summarize l

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
           l |     70,848    33.62432    18.14379          0         48

. 
. *************************************************************************
> *******
. 
. local num = `r(max)'

. 
. * Insert | into empty spaces in the variable named value 
. * so we can strip out the commas
. forvalues i = 1/10 {
  2.         replace value = subinstr(trim(value)," ","",.)
  3. }
(14,535 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. forvalues i = 1/10 {
  2.         replace value = subinstr(value,",,",",|,",.)
  3. }
(43,215 real changes made)
(43,215 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)

. replace value = "|" + value if substr(value,1,1) == ","
(45,951 real changes made)

. replace value = value + "|" if substr(value,-1,1) == ","
(21,868 real changes made)

. 
. replace value = strreverse(subinstr(value,","," ",.))
(55,959 real changes made)

. 
. *split value to variables
. forvalues n = 1/`num' {
  2.         gen value`n' = word(value,`n') if `n' <= l & word(value,`n') !
> = "|"
  3. 
. }
(36,757 missing values generated)
(36,713 missing values generated)
(36,689 missing values generated)
(36,669 missing values generated)
(36,666 missing values generated)
(36,632 missing values generated)
(36,614 missing values generated)
(36,626 missing values generated)
(36,642 missing values generated)
(36,627 missing values generated)
(36,615 missing values generated)
(36,214 missing values generated)
(36,619 missing values generated)
(36,592 missing values generated)
(36,583 missing values generated)
(36,606 missing values generated)
(36,581 missing values generated)
(36,528 missing values generated)
(36,552 missing values generated)
(36,523 missing values generated)
(36,559 missing values generated)
(36,479 missing values generated)
(36,462 missing values generated)
(36,024 missing values generated)
(37,070 missing values generated)
(41,560 missing values generated)
(41,744 missing values generated)
(41,793 missing values generated)
(41,748 missing values generated)
(41,736 missing values generated)
(41,734 missing values generated)
(41,688 missing values generated)
(41,726 missing values generated)
(41,744 missing values generated)
(41,892 missing values generated)
(50,364 missing values generated)
(66,145 missing values generated)
(70,139 missing values generated)
(70,766 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)
(70,848 missing values generated)

. 
. drop l1 l2 l value

. 
. list in 1

     +--------------------------------------------------------------------+
  1. |   id   |   phase    |       name    |   calstart    |   country    |
     |    1   |       1    |   fpstatus    |       1417    |        bf    |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     | value1 | value2  | value3  | value4  | value5  | value6  | value7  |
     |      0 |      0  |      0  |      0  |      0  |      P  |      P  |
     |--------+-----------------------------------------------------------|
     | value8 | value9 | value10 | value11 | value12 | value13 | value14  |
     |      P |      P |       P |       P |       P |       P |       B  |
     |--------------------------------------------------------------------|
     | value15  | value16  | value17  |  value18  |  value19  |  value20  |
     |       0  |       0  |       0  |        0  |        0  |        0  |
     |----------+----------+----------+-----------+-----------+-----------|
     | value21  | value22  | value23  |  value24  |  value25  |  value26  |
     |       0  |       0  |       0  |        0  |        0  |        0  |
     |----------+----------+----------+-----------+-----------+-----------|
     | value27  | value28  | value29  |  value30  |  value31  |  value32  |
     |          |          |          |           |           |           |
     |----------+----------+----------+-----------+-----------+-----------|
     | value33  | value34  | value35  |  value36  |  value37  |  value38  |
     |          |          |          |           |           |           |
     |----------+----------+----------+-----------+-----------+-----------|
     | value39  | value40  | value41  |  value42  |  value43  |  value44  |
     |          |          |          |           |           |           |
     |--------------------------------------------------------------------|
     |    value45     |    value46     |    value47     |     value48     |
     |                |                |                |                 |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * reshape to long again by value
. reshape long value, i(id phase name) j(month)
(j = 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 2
> 7 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48)

Data                               Wide   ->   Long
---------------------------------------------------------------------------
> --
Number of observations           70,848   ->   3,400,704   
Number of variables                  54   ->   8           
j variable (48 values)                    ->   month
xij variables:
              value1 value2 ... value48   ->   value
---------------------------------------------------------------------------
> --

. list in 1/10

     +--------------------------------------------------------------------+
  1. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      1   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   0                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  2. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      2   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   0                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  3. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      3   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   0                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  4. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      4   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   0                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  5. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      5   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   0                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  6. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      6   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   P                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  7. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      7   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   P                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  8. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      8   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   P                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
  9. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |      9   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   P                                |
     +--------------------------------------------------------------------+

     +--------------------------------------------------------------------+
 10. |  id  |  phase  |      name   |  month   |  calstart   |  country   |
     |   1  |      1  |  fpstatus   |     10   |      1417   |       bf   |
     |--------------------------------------------------------------------|
     | tempvalue                                                          |
     | , , , , , , , , , , 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, B, P, P,.. |
     |--------------------------------------------------------------------|
     |                               value                                |
     |                                   P                                |
     +--------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * gen calcmc to mark the calendar month
. gen calcmc = calstart + month - 1

. 
. *************************************************************************
> *******
. 
. keep id phase calcmc name value

. * reshape wide
. reshape wide value, i(id phase calcmc) j(name) string
(j = fpstatus whystop)

Data                               Long   ->   Wide
---------------------------------------------------------------------------
> --
Number of observations        3,400,704   ->   1,700,352   
Number of variables                   5   ->   5           
j variable (2 values)              name   ->   (dropped)
xij variables:
                                  value   ->   valuefpstatus valuewhystop
---------------------------------------------------------------------------
> --

. reshape wide valuefpstatus valuewhystop, i(id calcmc) j(phase)
(j = 1 2)

Data                               Long   ->   Wide
---------------------------------------------------------------------------
> --
Number of observations        1,700,352   ->   1,000,224   
Number of variables                   5   ->   6           
j variable (2 values)             phase   ->   (dropped)
xij variables:
                          valuefpstatus   ->   valuefpstatus1 valuefpstatus
> 2
                           valuewhystop   ->   valuewhystop1 valuewhystop2
---------------------------------------------------------------------------
> --

. rename valuefpstatus1 fpstatus_1

. rename valuefpstatus2 fpstatus_2

. rename valuewhystop1 whystop_1 

. rename valuewhystop2 whystop_2

. replace fpstatus_1 = trim(fpstatus_1)
(0 real changes made)

. replace fpstatus_2 = trim(fpstatus_2)
(0 real changes made)

. * filter data
. drop if missing(fpstatus_1) & fpstatus_2 == ""
(231,153 observations deleted)

. * sort data
. gsort id -calcmc

. list in 1/40, noobs

  +---------------------------------------------------------+
  | id   calcmc   fpstat~1   whysto~1   fpstat~2   whysto~2 |
  |---------------------------------------------------------|
  |  1     1453                                3            |
  |  1     1452                                3            |
  |  1     1451                                3            |
  |  1     1450                                3            |
  |  1     1449                                3            |
  |---------------------------------------------------------|
  |  1     1448                                3            |
  |  1     1447                                0            |
  |  1     1446                                0            |
  |  1     1445                                0            |
  |  1     1444                                0            |
  |---------------------------------------------------------|
  |  1     1443                                0            |
  |  1     1442          0                     0            |
  |  1     1441          0                     0            |
  |  1     1440          0                     0            |
  |  1     1439          0                     0            |
  |---------------------------------------------------------|
  |  1     1438          0                     0            |
  |  1     1437          0                     0            |
  |  1     1436          0                     0            |
  |  1     1435          0                     0            |
  |  1     1434          0                     0            |
  |---------------------------------------------------------|
  |  1     1433          0                     0            |
  |  1     1432          0                     0            |
  |  1     1431          0                     0            |
  |  1     1430          B                     B            |
  |  1     1429          P                     P            |
  |---------------------------------------------------------|
  |  1     1428          P                     P            |
  |  1     1427          P                     P            |
  |  1     1426          P                     P            |
  |  1     1425          P                     P            |
  |  1     1424          P                     P            |
  |---------------------------------------------------------|
  |  1     1423          P                     P            |
  |  1     1422          P                     0            |
  |  1     1421          0                     0            |
  |  1     1420          0                     0            |
  |  1     1419          0                     0            |
  |---------------------------------------------------------|
  |  1     1418          0                     0            |
  |  1     1417          0                     0            |
  |  2     1452                                5            |
  |  2     1451                                5            |
  |  2     1450                                5            |
  +---------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. save post6_cals, replace
(file post6_cals.dta not found)
file post6_cals.dta saved

. 
. *************************************************************************
> *******
. 
. * import the filtered data
. use post6_filtered_dataset, clear

. keep if fpcurreffmethrc_1 == 999
(7,138 observations deleted)

. replace unmetyn_1 = unmetyn_1 == 1
(1 real change made)

. 
. * mutate variables
. gen fpplanyr_1 = 0

. replace fpplanyr_1 = 1 if fpplanwhen_1 == 1 & fpplanval_1 <= 12
(923 real changes made)

. replace fpplanyr_1 = 1 if fpplanwhen_1 == 2 & fpplanval_1 == 1
(569 real changes made)

. replace fpplanyr_1 = 1 if fpplanwhen_1 == 3 | fpplanwhen_1 == 4
(1,023 real changes made)

. 
. *************************************************************************
> *******
. 
. ******the two way proportion tables for plot******
. levelsof country
1 2 7 9

. foreach lev in `r(levels)' {
  2.         table ( unmetyn_1 ) ( fpplanyr_1 ) () if country == `lev', sta
> tistic(proportion)
  3. }

-----------------------------------------
                 |        fpplanyr_1     
                 |      0       1   Total
-----------------+-----------------------
total unmet need |                       
  no unmet need  |  .5855   .1681   .7536
  unmet need     |  .1308   .1156   .2464
  Total          |  .7163   .2837       1
-----------------------------------------

-----------------------------------------
                 |        fpplanyr_1     
                 |      0       1   Total
-----------------+-----------------------
total unmet need |                       
  no unmet need  |  .6162   .1147    .731
  unmet need     |  .1368   .1323    .269
  Total          |   .753    .247       1
-----------------------------------------

-----------------------------------------
                 |        fpplanyr_1     
                 |      0       1   Total
-----------------+-----------------------
total unmet need |                       
  no unmet need  |  .6232   .1276   .7508
  unmet need     |  .1408   .1084   .2492
  Total          |   .764    .236       1
-----------------------------------------

------------------------------------------
                 |        fpplanyr_1      
                 |      0        1   Total
-----------------+------------------------
total unmet need |                        
  no unmet need  |  .7254   .07436   .7997
  unmet need     |  .1461   .05414   .2003
  Total          |  .8715    .1285       1
------------------------------------------

. 
. save post6_nonusers, replace
file post6_nonusers.dta saved

. 
. *************************************************************************
> *******
. 
. * Post 16 row dataset to make the joint & marginal probability plots
. 
. svyset _n, strata(country)

Sampling weights: <none>
             VCE: linearized
     Single unit: missing
        Strata 1: country
 Sampling unit 1: <observations>
           FPC 1: <zero>

. 
. capture postclose toplot

. tempfile postout

. postfile toplot unmetyn_1 fpplanyr_1 country margin_u margin_f joint usin
> g `postout', replace
(file C:\Users\DaleR\AppData\Local\Temp\ST_910_000002.tmp not found)

. 
. levelsof country, local(clist)
1 2 7 9

. foreach j in `clist' {
  2.         forvalues i = 0/1 {
  3.                 forvalues k = 0/1 {
  4.                         capture drop y
  5.                         gen y = unmetyn_1 == `i'
  6.                         quietly svy, subpop(if country == `j'): propor
> tion y 
  7.                         local postit (`i') (`k') (`j') (`=100*r(table)
> [1,2]') 
  8.                         capture drop y
  9.                         gen y = fpplanyr_1 == `k'
 10.                         quietly svy, subpop(if country == `j'): propor
> tion y 
 11.                         local postit `postit' (`=100*r(table)[1,2]') 
 12.                         capture drop y
 13.                         gen y = unmetyn_1 == `i' & fpplanyr_1 == `k'
 14.                         quietly svy, subpop(if country == `j'): propor
> tion y 
 15.                         local postit `postit' (`=100*r(table)[1,2]') 
 16.                         post toplot `postit'                    
 17.                 }
 18.         }
 19. }

. capture postclose toplot

. use `postout', clear

. 
. label define country 1 "BF" 2 "CD" 7 "KE" 9 "NG", replace

. label values country country

. 
. gen     margin_f_label = "Plan 1 Yr "     + string(round(margin_f,1.1)) +
>  "%" if fpplanyr_1 == 1
(8 missing values generated)

. replace margin_f_label = "No Plan 1 Yr "  + string(round(margin_f,1.1)) +
>  "%" if fpplanyr_1 == 0
variable margin_f_label was str15 now str18
(8 real changes made)

. gen     margin_u_label = "Unmet Need "    + string(round(margin_u,1.1)) +
>  "%" if unmetyn_1 == 1
(8 missing values generated)

. replace margin_u_label = "No Unmet Need " + string(round(margin_u,1.1)) +
>  "%" if unmetyn_1 == 0
variable margin_u_label was str16 now str19
(8 real changes made)

. 
. *************************************************************************
> *******
. 
. * Make four sub-plots
. 
. foreach c in 1 2 7 9 {  
  2.         heatplot joint margin_f_label margin_u_label if country == `c'
> , ///
>                 legend(off) graphregion(color(white))  ///
>                 values(format(%4.1f)) ///
>                 cuts(5 10 15 20 25) ///
>                 color(purples, intensity(0.6)) ///
>                 discrete ///
>                 xlabel(,  labsize(small) angle(45)) ///
>                 ylabel(,  labsize(small)) ///
>                 subtitle("`: label country `c''", size(small)) ///
>                 xtitle("") ytitle("") ///
>                 name(hm`c', replace)
  3. }

. 
. * Combine them together
. graph combine hm1 hm2 hm7 hm9, ///
>         rows(2) ///
>         title("Non-users: Unmet Need and Intentions to Adopt a Method wit
> hin 1 Year", size(medium)) ///
>         subtitle("Unweighted percentage among sampled women not currently
>  using any method at Phase 1", size(small)) ///
>         note("Percentages in each plot sum to 100%.", size(vsmall)) ///
>         graphregion(color(white)) ///
>         name(f6_01, replace)

.         
. graph export f6_01.png, width(2000) replace
file f6_01.png saved as PNG format

.         
. capture graph drop hm1 hm2 hm7 hm9

. 
. *************************************************************************
> *******
. 
. * Continue data management to prep for exploratory survival analysis
. 
. use post6_nonusers, clear

. 
. * keep only certain variables
. keep id country intfqcmc_1 unmetyn_1 fpplanyr_1

. save post6_nonuser, replace
(file post6_nonuser.dta not found)
file post6_nonuser.dta saved

. * merge post6_nonuser and post6_cals
. use post6_cals, clear

. merge m:1 id using post6_nonuser, nogenerate 

    Result                      Number of obs
    -----------------------------------------
    Not matched                       318,751
        from master                   318,751  
        from using                          0  

    Matched                           450,320  
    -----------------------------------------

. * only keep months after intfqcmc_1 and exclude women for whom either 
. * UNMETYN_1 or FPPLANYR_1 is missing, NIU, or otherwise coded NA
. keep if calcmc >= intfqcmc_1
(650,886 observations deleted)

. keep if !missing(fpstatus_2) & !missing(unmetyn_1) & !missing(fpplanyr_1)
(1,325 observations deleted)

. list in 1/20, noobs

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1453 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1452 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1451 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1450 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1449 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1448 |          |          |        3 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1447 |          |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1446 |          |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1445 |          |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1444 |          |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1443 |          |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  1 |   1442 |        0 |          |        0 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1442       |              1       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1452 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1451 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1450 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1449 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1448 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1447 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1446 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

  +-------------------------------------------------------------------+
  | id | calcmc | fpstat~1 | whysto~1 | fpstat~2 | whysto~2 | country |
  |  2 |   1445 |          |          |        5 |          | burkina |
  |-------------------------------------------------------------------|
  |      unmety~1       |       intfqc~1       |       fpplan~1       |
  |      no unmet       |           1441       |              0       |
  +-------------------------------------------------------------------+

. 
. *************************************************************************
> *******
. 
. * keep variable and gen mo & use
. gen mo = calcmc - intfqcmc_1

. gen use = fpstatus_2 != "0" & fpstatus_2 != "B" & fpstatus_2 != "P" & fps
> tatus_2 != "T"

. 
. *************************************************************************
> *******
. 
. * gen usemo, stop and rc
. * changes made here:
. * change the variable stop to adopt; stop2 to adopt2 
. bysort id: gen usemo = mo if use == 1
(99,194 missing values generated)

. bysort id: egen use_sum = sum(use)

. bysort id: egen adopt = min(usemo) if use_sum >= 1
(88,342 missing values generated)

. bysort id: egen adopt2 = max(mo) if use_sum == 0
(28,518 missing values generated)

. replace adopt = adopt2 if missing(adopt)
(88,342 real changes made)

. drop adopt2 use_sum

. bysort id: gen rc = 1 if adopt == mo & use == 0
(109,899 missing values generated)

. bysort id: replace rc = 0 if adopt == mo & use == 1
(2245 real changes made)

. 
. *************************************************************************
> *******
. 
. * filter data to keep only the last month a woman is not using any method
. * change the variable stop to adopt 
. keep if adopt == mo
(107,654 observations deleted)

. 
. *************************************************************************
> *******
. 
. gen     interact_1 = "Unmet Need, Plan 1 Yr"       if unmetyn_1 == 1 & fp
> planyr_1 == 1
(8,273 missing values generated)

. replace interact_1 = "Unmet Need, No Plan 1 Yr"    if unmetyn_1 == 1 & fp
> planyr_1 == 0
variable interact_1 was str21 now str24
(1,149 real changes made)

. replace interact_1 = "No Unmet Need, Plan 1 Yr"    if unmetyn_1 == 0 & fp
> planyr_1 == 1
(1,189 real changes made)

. replace interact_1 = "No Unmet Need, No Plan 1 Yr" if unmetyn_1 == 0 & fp
> planyr_1 == 0
variable interact_1 was str24 now str27
(5,935 real changes made)

. save post6_survival,replace
(file post6_survival.dta not found)
file post6_survival.dta saved

. 
. *************************************************************************
> *******
. 
. use post6_survival, clear

. gen notrc = !rc

. 
. * Survial analysis stset command to set up for sts list and sts graph com
> mands
. * Because we have failures at month zero, we specify the "origin(min)" op
> tion
. * which counts participants as entering observation at the earliest time
. * observed minus 1.  This helps us match the R survival analysis output. 
. stset mo, failure(notrc) origin(min)

Survival-time data settings

         Failure event: notrc!=0 & notrc<.
Observed time interval: (origin, mo]
     Exit on or before: failure
     Time for analysis: (time-origin)
                Origin: min

--------------------------------------------------------------------------
      9,206  total observations
          0  exclusions
--------------------------------------------------------------------------
      9,206  observations remaining, representing
      2,245  failures in single-record/single-failure data
     98,758  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =        16

. 
. *************************************************************************
> *******
. 
. * Look at failures for Burkina Faso in tabular format, by unmet need stat
> us
. sts list if co == 1, failure by(unmetyn_1 )

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

Kaplan–Meier failure function
By variable: unmetyn_1

             At           Net     Failure      Std.
  Time     risk   Fail   lost    function     error     [95% conf. int.]
------------------------------------------------------------------------
no unmet need 
     1     2245    157      0      0.0699    0.0054     0.0601    0.0813
     2     2088     20      0      0.0788    0.0057     0.0684    0.0908
     3     2068     21      0      0.0882    0.0060     0.0772    0.1007
     4     2047     25      0      0.0993    0.0063     0.0877    0.1125
     5     2022     27      0      0.1114    0.0066     0.0990    0.1251
     6     1995     22      0      0.1212    0.0069     0.1083    0.1354
     7     1973     27      0      0.1332    0.0072     0.1198    0.1479
     8     1946     26      0      0.1448    0.0074     0.1309    0.1600
     9     1920     30      0      0.1581    0.0077     0.1437    0.1739
    10     1890     37      0      0.1746    0.0080     0.1595    0.1910
    11     1853     35     97      0.1902    0.0083     0.1746    0.2071
    12     1721     27    906      0.2029    0.0085     0.1868    0.2202
    13      788      5    687      0.2080    0.0087     0.1914    0.2257
    14       96      3     70      0.2327    0.0164     0.2024    0.2668
    15       23      0     23      0.2327    0.0164     0.2024    0.2668
unmet need 
     1      632     86      0      0.1361    0.0136     0.1116    0.1653
     2      546     15      0      0.1598    0.0146     0.1335    0.1908
     3      531      6      0      0.1693    0.0149     0.1422    0.2009
     4      525      9      0      0.1835    0.0154     0.1555    0.2160
     5      516      6      0      0.1930    0.0157     0.1643    0.2260
     6      510     13      0      0.2136    0.0163     0.1837    0.2477
     7      497     11      0      0.2310    0.0168     0.2001    0.2659
     8      486     12      0      0.2500    0.0172     0.2181    0.2857
     9      474     11      0      0.2674    0.0176     0.2347    0.3037
    10      463     15      0      0.2911    0.0181     0.2574    0.3283
    11      448      8     21      0.3038    0.0183     0.2696    0.3413
    12      419     11    257      0.3221    0.0186     0.2871    0.3601
    13      151      1    135      0.3266    0.0190     0.2908    0.3654
    14       15      1     12      0.3715    0.0469     0.2875    0.4707
    15        2      0      2      0.3715    0.0469     0.2875    0.4707
------------------------------------------------------------------------
Note: Net lost equals the number lost minus the number who entered.

. 
. *************************************************************************
> *******
. 
. sts graph if co == 1, failure by(unmetyn_1 ) ylabel(0(.2)1.0, angle(0)) /
> //
> ci title(Burkina Faso, size(small)) graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No unmet need" 3 "Unmet nee
> d") ///
> row(1)) name(hm1, replace) xtitle(Months After Phase 1 Interview, size(sm
> all)) 

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 2, failure by(unmetyn_1 ) ylabel(0(.2)1.0, angle(0)) /
> //
> ci title(DR Congo, size(small))     graphregion(color(white))   ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No unmet need" 3 "Unmet nee
> d") ///
> row(1)) name(hm2, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 7, failure by(unmetyn_1 ) ylabel(0(.2)1.0, angle(0)) /
> //
> ci title(Kenya, size(small))        graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No unmet need" 3 "Unmet nee
> d") ///
> row(1)) name(hm3, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 9, failure by(unmetyn_1 ) ylabel(0(.2)1.0, angle(0)) /
> //
> ci title(Nigeria, size(small))      graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No unmet need" 3 "Unmet nee
> d") ///
> row(1)) name(hm4, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. grc1leg2  hm1 hm2 hm3 hm4, rows(2) graphregion(color(white)) legend(hm1) 
> ///
> name(f6_02, replace) ///
> title(Predicted Time to FP Adoption by Phase 1 Unmet Need Status, size(sm
> all)) ///
> xcommon ycommon
-grc1leg2- working...
Warning: Because the legend borrowed for the combined graph is not "complet
> e",
automatic resizing of legend markers is disabled and grc1leg2 ignores the o
> ption -lmsize-.
See the discussion of "known issues" in grc1leg2's help file here.

. 
. graph export f6_02.png, width(2000) replace
file f6_02.png saved as PNG format

. 
. *************************************************************************
> *******
. 
. sts graph if co == 1, failure by(fpplanyr_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Burkina Faso, size(small)) graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No plan 1yr" 3 "Plan 1yr") 
> ///
> row(1)) name(hm1, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 2, failure by(fpplanyr_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(DR Congo, size(small))     graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No plan 1yr" 3 "Plan 1yr") 
> ///
> row(1)) name(hm2, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 7, failure by(fpplanyr_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Kenya, size(small))        graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No plan 1yr" 3 "Plan 1yr") 
> ///
> row(1)) name(hm3, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 9, failure by(fpplanyr_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Nigeria, size(small))      graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) legend(size(small) symxsize(small
> ) ///
> symysize(small) region(lcolor(none)) order(1 "No plan 1yr" 3 "Plan 1yr") 
> ///
> row(1)) name(hm4, replace) xtitle(Months After Phase 1 Interview, size(sm
> all))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. grc1leg2  hm1 hm2 hm3 hm4, rows(2) graphregion(color(white)) legend(hm1) 
> ///
> name(f6_03, replace) ///
> title(Predicted Time to FP Adoption by Intentions Within 1 Year of Phase 
> 1, ///
> size(small)) xcommon ycommon
-grc1leg2- working...
Warning: Because the legend borrowed for the combined graph is not "complet
> e",
automatic resizing of legend markers is disabled and grc1leg2 ignores the o
> ption -lmsize-.
See the discussion of "known issues" in grc1leg2's help file here.

. 
. graph export f6_03.png, width(2000) replace
file f6_03.png saved as PNG format

. 
. *************************************************************************
> *******
. 
. sts graph if co == 1, failure by(interact_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Burkina Faso, size(small)) graphregion(color(white)) ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) ///
> legend(size(small) symxsize(small) ///
> symysize(small) region(lcolor(none)) ///
> order(9 "No need; No plan" 10 "No need; Plan 1yr" 11 "Unmet need; No plan
> " ///
> 12 "Unmet need; Plan 1yr" )) name(hm1, replace) ///
> xtitle(Months After Phase 1 Interview, size(small))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

.                 
. sts graph if co == 2, failure by(interact_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(DR Congo, size(small))     graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) ///
> legend(size(small) symxsize(small) ///
> symysize(small) region(lcolor(none)) ///
> order(9 "No need; No plan" 10 "No need; Plan 1yr" 11 "Unmet need; No plan
> " ///
> 12 "Unmet need; Plan 1yr" )) name(hm2, replace) ///
> xtitle(Months After Phase 1 Interview, size(small))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 7, failure by(interact_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Kenya, size(small))        graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) ///
> legend(size(small) symxsize(small) ///
> symysize(small) region(lcolor(none)) ///
> order(9 "No need; No plan" 10 "No need; Plan 1yr" 11 "Unmet need; No plan
> " ///
> 12 "Unmet need; Plan 1yr" )) name(hm3, replace) ///
> xtitle(Months After Phase 1 Interview, size(small))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. sts graph if co == 9, failure by(interact_1 ) ylabel(0(.2)1.0, angle(0)) 
> ///
> ci title(Nigeria, size(small))      graphregion(color(white))  ///
> yline(1,lcolor(ltblue*.5) lwidth(thin)) ///
> legend(size(small) symxsize(small) ///
> symysize(small) region(lcolor(none)) ///
> order(9 "No need; No plan" 10 "No need; Plan 1yr" 11 "Unmet need; No plan
> " ///
>  12 "Unmet need; Plan 1yr" )) name(hm4, replace) ///
>  xtitle(Months After Phase 1 Interview, size(small))

        Failure _d: notrc
  Analysis time _t: (mo-origin)
            Origin: min

. 
. grc1leg2  hm1 hm2 hm3 hm4, rows(2) graphregion(color(white)) legend(hm1) 
> ///
> name(f6_04, replace) ///
> title(Predicted Time to FP Adoption by Phase 1 Intentions and Unmet Need,
>  ///
> size(small)) xcommon ycommon
-grc1leg2- working...
Warning: Because the legend borrowed for the combined graph is not "complet
> e",
automatic resizing of legend markers is disabled and grc1leg2 ignores the o
> ption -lmsize-.
See the discussion of "known issues" in grc1leg2's help file here.

. 
. graph export f6_04.png, width(2000) replace
file f6_04.png saved as PNG format

. 
. *************************************************************************
> *******
. 
. * Cleanup
. 
. capture erase post6_filtered_dataset.dta

. capture erase post6_cal1.dta

. capture erase post6_cals.dta

. capture erase post6_nonuser.dta

. capture erase post6_survival.dta

. 
. capture log close
